### MANAGING THE DATABASE ACCESS

Download the pymysql library to manage the mysql database

In [1]:
!pip install pymysql

Requirement already satisfied: pymysql in /opt/anaconda3/lib/python3.9/site-packages (1.0.2)

Importing the needed libraries

In [1]:
import os
import sqlalchemy
SQLALCHEMY_SILENCE_UBER_WARNING = 1
SQLALCHEMY_WARN_20 = 0
import pandas as pd
import datetime
import pymysql

Give value to all the variables to access to mysql database

In [2]:
db_host = 'NotMyRealHost23'
db_user = 'NotMyRealUsername23'
db_pass = 'NotMyRealPassword23'
db_name = 'NotMyRealDBName23'
db_port = 3306

Declare the function to connect to database

In [3]:
def connect_tcp_socket(
    db_host, db_user, db_pass, db_name, db_port = 3306
    ) -> sqlalchemy.engine.base.Engine:
    """ Initializes a TCP connection pool for a Cloud SQL instance of MySQL. """

    engine = sqlalchemy.create_engine(
        sqlalchemy.engine.url.URL.create(
            drivername="mysql+pymysql",
            username=db_user,
            password=db_pass,
            host=db_host,
            port=db_port,
            database=db_name,
        ),
    )
    return engine

Connect to the database via the above function

In [4]:
engine = connect_tcp_socket(db_host, db_user, db_pass, db_name, db_port = 3306)
conn = engine.connect()

In [5]:
print(conn)

<sqlalchemy.engine.base.Connection object at 0x7fbc80d6e760>

Show tables already inserted in the DATABASE

In [6]:
result = conn.execute("SHOW TABLES;").fetchall()
for r in result:
    print(r)
if not result:
    print("No tables in the DATABASE")

No tables in the DATABASE

### LOADING THE DATA

Importing the needed libraries

Creating a function to remove all the unnamed columns in the datasets.

In [7]:
def remove_unnamed_cols(df):
  df = df.loc[:, ~df.columns.str.contains('^Unnamed')]
  return df

Creating a function to load the data.

In [8]:
transactions = pd.read_csv('transactions_sample.csv')
transactions.shape

(600000, 5)

In [9]:
transactions.head(2)

,t_dat,customer_id,article_id,price,sales_channel_id
0,2018-09-20,000058a12d5b43e67d225668fa1f8d618c13dc232df0ca...,663713001,0.050831,2
1,2018-09-20,000058a12d5b43e67d225668fa1f8d618c13dc232df0ca...,541518023,0.030492,2

In [11]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600000 entries, 0 to 599999
Data columns (total 5 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   t_dat             600000 non-null  object
 1   customer_id       600000 non-null  object
 2   article_id        600000 non-null  int64
 3   price             600000 non-null  float64
 4   sales_channel_id  600000 non-null  int64
dtypes: float64(1), int64(2), object(2)
memory usage: 22.9+ MB

In [12]:
transactions.to_sql(
    con = conn, name = "transactions", if_exists = "replace")

600000

In [14]:
result = conn.execute("SHOW TABLES;").fetchall()
for r in result:
    print(r)
if not result:
    print("No tables in the DATABASE")

('transactions',)

In [15]:
customers = pd.read_csv('customers.csv')
customers.shape

(1371980, 7)

In [16]:
customers.head(2)

,customer_id,FN,Active,club_member_status,fashion_news_frequency,age,postal_code
0,00000dbacae5abe5e23885899a1fa44253a17956c6d1c3...,NaN,NaN,ACTIVE,NONE,49.0,52043ee2162cf5aa7ee79974281641c6f11a68d276429a...
1,0000423b00ade91418cceaf3b26c6af3dd342b51fd051e...,NaN,NaN,ACTIVE,NONE,25.0,2973abc54daa8a5f8ccfe9362140c63247c5eee03f1d93...

In [17]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1371980 entries, 0 to 1371979
Data columns (total 7 columns):
 #   Column                  Non-Null Count    Dtype
---  ------                  --------------    -----
 0   customer_id             1371980 non-null  object
 1   FN                      476930 non-null   float64
 2   Active                  464404 non-null   float64
 3   club_member_status      1365918 non-null  object
 4   fashion_news_frequency  1355971 non-null  object
 5   age                     1356119 non-null  float64
 6   postal_code             1371980 non-null  object
dtypes: float64(3), object(4)
memory usage: 73.3+ MB

In [18]:
customers.to_sql(
    con = conn, name = "customers", if_exists = "replace")

1371980

In [19]:
result = conn.execute("SHOW TABLES;").fetchall()
for r in result:
    print(r)
if not result:
    print("No tables in the DATABASE")

('customers',)
('transactions',)

In [20]:
articles = pd.read_csv('articles.csv')
articles.shape

(105542, 25)

In [21]:
articles.head(2)

,article_id,product_code,prod_name,product_type_no,product_type_name,product_group_name,graphical_appearance_no,graphical_appearance_name,colour_group_code,colour_group_name,...,department_name,index_code,index_name,index_group_no,index_group_name,section_no,section_name,garment_group_no,garment_group_name,detail_desc
0,108775015,108775,Strap top,253,Vest top,Garment Upper body,1010016,Solid,9,Black,...,Jersey Basic,A,Ladieswear,1,Ladieswear,16,Womens Everyday Basics,1002,Jersey Basic,Jersey top with narrow shoulder straps.
1,108775044,108775,Strap top,253,Vest top,Garment Upper body,1010016,Solid,10,White,...,Jersey Basic,A,Ladieswear,1,Ladieswear,16,Womens Everyday Basics,1002,Jersey Basic,Jersey top with narrow shoulder straps.

In [22]:
articles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105542 entries, 0 to 105541
Data columns (total 25 columns):
 #   Column                        Non-Null Count   Dtype
---  ------                        --------------   -----
 0   article_id                    105542 non-null  int64
 1   product_code                  105542 non-null  int64
 2   prod_name                     105542 non-null  object
 3   product_type_no               105542 non-null  int64
 4   product_type_name             105542 non-null  object
 5   product_group_name            105542 non-null  object
 6   graphical_appearance_no       105542 non-null  int64
 7   graphical_appearance_name     105542 non-null  object
 8   colour_group_code             105542 non-null  int64
 9   colour_group_name             105542 non-null  object
 10  perceived_colour_value_id     105542 non-null  int64
 11  perceived_colour_value_name   105542 non-null  object
 12  perceived_colour_master_id    105542 non-null  int64
 13  perceived_colour_master_name  105542 non-null  object
 14  department_no                 105542 non-null  int64
 15  department_name               105542 non-null  object
 16  index_code                    105542 non-null  object
 17  index_name                    105542 non-null  object
 18  index_group_no                105542 non-null  int64
 19  index_group_name              105542 non-null  object
 20  section_no                    105542 non-null  int64
 21  section_name                  105542 non-null  object
 22  garment_group_no              105542 non-null  int64
 23  garment_group_name            105542 non-null  object
 24  detail_desc                   105126 non-null  object
dtypes: int64(11), object(14)
memory usage: 20.1+ MB

In [23]:
articles.to_sql(
    con = conn, name = "articles", if_exists = "replace")

105542

In [10]:
result = conn.execute("SHOW TABLES;").fetchall()
for r in result:
    print(r)
if not result:
    print("No tables in the DATABASE")

('articles',)
('customers',)
('transactions',)
('user_credentials',)

In [12]:
result = conn.execute("SELECT * FROM user_credentials LIMIT 30;").fetchall()
for r in result:
    print(r)

(1, 'sophie', None, 'eminem')
(2, 'pablo_escobar', None, 'drugs')
(3, 'calvin', None, 'klein')
(6, 'josef', '', 'halo')
(8, 'marshall_mathers', 'eminem@gmail.com', 'mockingbird')
(9, 'bugs_bunny', None, 'carrot')
(10, 'tinkerbell', 'tinker@bell.com', 'peterpan')
(13, 'leander_scha', 'leander_scha@gmail.com', 'hi123')
(14, 'billy_joel', None, 'pianoman')